class EmployeeReferenceData {
  static const genders = ['مرد', 'زن'];

  static const employmentTypes = ['قراردادی', 'توافقی'];

  static const educations = [
    'زیر دیپلم',
    'دیپلم',
    'فوق دیپلم',
    'کارشناسی',
    'کارشناسی ارشد',
    'دکتری',
    'فوق دکتری',
  ];

  static const bankAccountTypes = [
    'جاری',
    'پس انداز',
    'قرض الحسنه',
    'کوتاه مدت',
    'بلندمدت',
    'سپرده سرمایه گذاری',
    'حقوق و دستمزد',
  ];

  static const iranianBanks = [
    'بانک ملی ایران',
    'بانک سپه',
    'بانک صنعت و معدن',
    'بانک کشاورزی',
    'بانک مسکن',
    'بانک توسعه صادرات ایران',
    'بانک توسعه تعاون',
    'پست بانک ایران',
    'بانک قرض الحسنه مهر ایران',
    'بانک قرض الحسنه رسالت',
    'بانک تجارت',
    'بانک ملت',
    'بانک صادرات ایران',
    'بانک رفاه کارگران',
    'بانک پارسیان',
    'بانک پاسارگاد',
    'بانک کارآفرین',
    'بانک سامان',
    'بانک سینا',
    'بانک سرمایه',
    'بانک شهر',
    'بانک دی',
    'بانک اقتصاد نوین',
    'بانک ایران زمین',
    'بانک گردشگری',
    'بانک خاورمیانه',
    'بانک آینده',
    'موسسه اعتباری ملل',
    'موسسه اعتباری نور',
  ];
}
